In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(4,3),['a','b','c','d'],['X','Y','Z'])

In [5]:
df

          X         Y         Z
a -0.017341  0.422736  0.694597
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [7]:
bool_df = df > 0

In [8]:
bool_df

       X      Y      Z
a  False   True   True
b   True  False   True
c  False   True  False
d  False  False  False

In [9]:
df[bool_df]

          X         Y         Z
a       NaN  0.422736  0.694597
b  1.529896       NaN  0.125661
c       NaN  2.285080       NaN
d       NaN       NaN       NaN

In [10]:
df[df > 0]

          X         Y         Z
a       NaN  0.422736  0.694597
b  1.529896       NaN  0.125661
c       NaN  2.285080       NaN
d       NaN       NaN       NaN

In [11]:
df

          X         Y         Z
a -0.017341  0.422736  0.694597
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [12]:
df['Y'] > 1

a    False
b    False
c     True
d    False
Name: Y, dtype: bool

In [13]:
df[df['Y'] > 1] # таким образом вернет всю строку а не NaN

          X        Y         Z
c -1.086097  2.28508 -2.050613

In [14]:
type(df['Y'])

pandas.core.series.Series

In [15]:
df

          X         Y         Z
a -0.017341  0.422736  0.694597
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [16]:
df[df['X'] < 0]

          X         Y         Z
a -0.017341  0.422736  0.694597
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [18]:
res_df = df[df['X'] < 0]

In [19]:
res_df

          X         Y         Z
a -0.017341  0.422736  0.694597
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [20]:
res_df['Z']

a    0.694597
c   -2.050613
d   -1.696319
Name: Z, dtype: float64

In [21]:
df[df['X'] < 0]['Z']

a    0.694597
c   -2.050613
d   -1.696319
Name: Z, dtype: float64

In [23]:
df[df['X'] < 0][['Z','X']]  #сокращенная запись, после идеет расширенная запись для понимания

          Z         X
a  0.694597 -0.017341
c -2.050613 -1.086097
d -1.696319 -0.292030

In [24]:
bool_ser = df['X'] < 0

In [25]:
bool_ser

a     True
b    False
c     True
d     True
Name: X, dtype: bool

In [26]:
result_df = df[bool_ser]

In [27]:
result_df

          X         Y         Z
a -0.017341  0.422736  0.694597
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [29]:
result_df[['X','Z']]

          X         Z
a -0.017341  0.694597
c -1.086097 -2.050613
d -0.292030 -1.696319

In [30]:
df

          X         Y         Z
a -0.017341  0.422736  0.694597
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [33]:
df[(df['X'] < 0) & (df['Z'] > 0)]  #Значения в столбце X < 0 И в столбце z > -

          X         Y         Z
a -0.017341  0.422736  0.694597

In [35]:
df[(df['X'] > 0) | (df['Z'] < 0)]#Значения в столбце X > 0 ИЛИ в столбце z < -

          X         Y         Z
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [36]:
df

          X         Y         Z
a -0.017341  0.422736  0.694597
b  1.529896 -1.175223  0.125661
c -1.086097  2.285080 -2.050613
d -0.292030 -0.456753 -1.696319

In [37]:
df.reset_index(inplace=True)

In [38]:
df

  index         X         Y         Z
0     a -0.017341  0.422736  0.694597
1     b  1.529896 -1.175223  0.125661
2     c -1.086097  2.285080 -2.050613
3     d -0.292030 -0.456753 -1.696319

In [39]:
z1 =[2,3,5,6]

In [40]:
df['Z1'] = z1

In [41]:
df

  index         X         Y         Z  Z1
0     a -0.017341  0.422736  0.694597   2
1     b  1.529896 -1.175223  0.125661   3
2     c -1.086097  2.285080 -2.050613   5
3     d -0.292030 -0.456753 -1.696319   6

In [46]:
df.set_index('Y')

KeyError: "None of ['Y'] are in the columns"

In [44]:
df.set_index('Y',inplace=True)

In [45]:
df

          index         X         Z  Z1
Y
 0.422736     a -0.017341  0.694597   2
-1.175223     b  1.529896  0.125661   3
 2.285080     c -1.086097 -2.050613   5
-0.456753     d -0.292030 -1.696319   6